{
	"B01LYOCVZF": {
		"reviews": [
			{
				"rating": 4,
				"title": "A Convenient and Versatile Gaming Boost: $5 Nintendo eShop Gift Card Review",
				"body": "The $5 Nintendo eShop Gift Card [Digital Code] is a great way to add funds to your Nintendo eShop balance and purchase digital games, DLC, and other content for your Nintendo Switch console. The card is easy to use and can be redeemed directly on the eShop website or through the Nintendo Switch eShop app.The $5 Nintendo eShop Gift Card is a great value for the price. It can be used to purchase a variety of games, including new releases, indie games, and classic titles. The card can also be used to purchase DLC, such as new levels, characters, and costumes for your favorite games.The $5 Nintendo eShop Gift Card is a great way to support your favorite indie developers. Many indie games are only available for purchase on the Nintendo eShop, so the $5 Nintendo eShop Gift Card is a great way to help these developers make more games.The $5 Nintendo eShop Gift Card is a great gift for any Nintendo Switch owner. It's a great way to let them know that you care about their gaming hobby and that you want to help them expand their collection of games.Here are some of the pros and cons of the $5 Nintendo eShop Gift Card:**Pros:*** Easy to use* Great value for the price* Can be used to purchase a variety of games and DLC* Supports indie developers* A great gift for any Nintendo Switch owner**Cons:*** Can only be used on the Nintendo Switch console* Cannot be used to purchase physical games or merchandise* Not all games are available for purchase on the Nintendo eShopOverall, the $5 Nintendo eShop Gift Card is a great way to add funds to your Nintendo eShop balance and purchase digital games, DLC, and other content for your Nintendo Switch console. The card is easy to use and can be redeemed directly on the eShop website or through the Nintendo Switch eShop app. The $5 Nintendo eShop Gift Card is a great value for the price and can be used to purchase a variety of games and DLC. The card is also a great way to support indie developers and a great gift for any Nintendo Switch owner.",
				"name": "marcos sarita",
				"date": "June 8, 2023"
			},
			{
				"rating": 5,
				"title": "WORKS ON 3DS-HERE'S HOW",
				"body": "The 3DS Nintendo eShop is closing towards the end of March 2023, so you bought this card, got your code, and the 3DS says you cannot add funds from your 3DS' eShop, so you freak out while simultaneously raging. Do not worry, you CAN add the funds to your 3DS account! Don't worry if you added your funds to your Nintendo Switch account, I have the whole process explained on how to get your funds on your 3DS' eShop!So I previously purchased the $20 card from Amazon, then the $35 card from Walmart's website. Today, I added the $35 to my Nintendo (Switch) account, but I merged the funds with my 3DS Nintendo Network ID. Here's how I did it:The 3DS eShop will give you an error code, saying that you cannot add funds to your account directly from the 3DS's eShop \"Add funds\" options. However, yes you can! I will tell you how, which is what saved me from chucking my 3DS XL across my bedroom lol1. Do you have a Nintendo Network ID? You will need a Nintendo Network ID, which isn't the same as your Nintendo account. But it's perfectly okay if you've already added the funds to your Switch account! To check your account info, click on the wrench/house settings button at the top left corner of your 3DS's home menu page. Scroll all the way down and click on the little wrench icon. Click on the two at the top center, and select \"Profile settings.\" Enter your password and scroll down to get your email associated with your My Nintendo account. Your Network ID is also displayed along the top screen. You will need this info, so write them down. If you don't have a Nintendo Network ID/account, you will need to sign up for one real quick on Nintendo's website, which is quick & easy to do!2. If you already have a Nintendo Network ID, or need to sign up for one, go to/use that info to log in to the website mynintendo.com NOT Nintendo.com! If you'd like to, write down the ID and password for the next steps.3. On the website, click on your profile name/photo at the upper right corner, and select \"Account settings.\"4. Scroll down a tad and you will see \"Nintendo Network ID.\" Make sure the Nintendo Network ID listed (if there is one) matches the one that was shown on your 3DS system. If one is not linked, or the wrong one is linked, click \"edit\" right above it, and change it to the Nintendo Network ID listed on your 3DS, case sensitive, which means exactly as it appears on your 3DS, capitalized letters, spaces, numbers, etc. as well as your account password, and it will automatically link it to your account when you save it.5. On the left side of the screen, click on \"Shop menu. You will see your funds in your account, but not (yet) in your 3DS' eShop, which is a good thing, because it means that your funds are available to you! However, if you want to add more funds, you can do so on this page, via credit card, debt card, or PayPal account. Scroll down and make sure the Nintendo Network ID listed below in that small rectangular box is the exact one as the one listed on your 3DS, and click on \"Merge funds\" right below that, and click on \"Merge funds\" again when it pops up. It should merge your Nintendo Switch funds with your 3DS funds.6. If you still have the 3DS' eShop open, close it and then reopen it, and your funds should be available on your 3DS' eShop!You may repeat this process as often as necessary until the eShop on 3DS closes.I hope this helps! :)",
				"name": "Hannah205",
				"date": "March 17, 2023"
			},
			{
				"rating": 5,
				"title": "Amazingly fast delivery!",
				"body": "Got extra fast prime delivery! It arrived instantly!In all seriousness though this was a great add-on purchase for the remainder of my son’s Amazon gift card. The code was immediately available. There are loads of games available on sale in the Nintendo eshop for $10 or less. I had some extra Nintendo points and was able to get him one of the other games he really wanted!",
				"name": "Christopher Otero",
				"date": "August 10, 2023"
			},
			{
				"rating": 5,
				"title": "Glad they have a $5 amount offered",
				"body": "The thing I like mostly about these cards is that you can buy them in $5 increments like you used to be able to do with GameStop but unfortunately you can no longer do. They are legit and official and easy to use.",
				"name": "J.Vinson",
				"date": "August 9, 2023"
			},
			{
				"rating": 5,
				"title": "Works",
				"body": "Code works perfectly fine with no issues on my Nintendo switch.",
				"name": "Jess",
				"date": "August 25, 2023"
			},
			{
				"rating": 5,
				"title": "Cause it's Nintendo",
				"body": "Easy turn around and then you can jist cut and paste the code to the Nintendo site to credit your acct.",
				"name": "Chris Noice",
				"date": "August 19, 2023"
			},
			{
				"rating": 5,
				"title": "Redeemable in an instant",
				"body": "You won’t have to wait to get your code, at least I didn’t. I was able to use it within a minute or two of completing the purchase. Can’t beat that.",
				"name": "Rich S. R.",
				"date": "August 12, 2023"
			},
			{
				"rating": 5,
				"title": "great socks",
				"body": "this was a gift for my son he loved this he is a gamer.",
				"name": "faith barber",
				"date": "August 21, 2023"
			},
			{
				"rating": 5,
				"title": "Good",
				"body": "Used it to buy other games",
				"name": "Erick caamal",
				"date": "August 27, 2023"
			},
			{
				"rating": 5,
				"title": "Yes",
				"body": "I’ve enjoyed my switch ever since this purchase and currently about to make another one",
				"name": "Knova Kane",
				"date": "August 19, 2023"
			},
			{
				"rating": 5,
				"title": "Works as expected.",
				"body": "Code was simple to use.",
				"name": "Renee Drzewiecki",
				"date": "August 27, 2023"
			},
			{
				"rating": 5,
				"title": "Worked as usual",
				"body": "Worked as usel",
				"name": "John Phillips",
				"date": "August 26, 2023"
			},
			{
				"rating": 5,
				"title": "Worked great",
				"body": "Automatically to my email, I worked great !!!",
				"name": "Andrea Moore",
				"date": "August 20, 2023"
			},
			{
				"rating": 4,
				"title": "This product won't work for me anymore due to the 3ds closing",
				"body": "I mean it's money. if you have a friend, family member, or anything else, it does the trick. However, it no longer works on the 3ds or Wii U.",
				"name": "PumpkinBeast",
				"date": "August 14, 2023"
			},
			{
				"rating": 5,
				"title": "Card worked the 2nd time",
				"body": "The code worked the 2nd time",
				"name": "Cindy Mcgee",
				"date": "August 19, 2023"
			},
			{
				"rating": 5,
				"title": "works",
				"body": "its a gift card... it works",
				"name": "Jovinscki Plaisival",
				"date": "August 19, 2023"
			},
			{
				"rating": 5,
				"title": "Nintendo Switch monies",
				"body": "This is great for your Nintendo player. Get some DLC’s.",
				"name": "Dan Gonzalez",
				"date": "August 19, 2023"
			},
			{
				"rating": 5,
				"title": "Excelente",
				"body": "Entregas al instante en mi correo",
				"name": "Daniel Martínez",
				"date": "August 21, 2023"
			},
			{
				"rating": 5,
				"title": "Gifted to grandson",
				"body": "Was easy for my grandson to add to his nintendo account . This is a great gift especially if you are living ling distance from the grandkids , nieces, nephews etc. I have purchased 3 in the last couple of years.  5*",
				"name": "KLC",
				"date": "July 26, 2023"
			},
			{
				"rating": 5,
				"title": "Ok",
				"body": "Easy to use",
				"name": "Curtis l",
				"date": "August 20, 2023"
			},
			{
				"rating": 5,
				"title": "Quick and works",
				"body": "Nice and quick",
				"name": "Sterling Wentworth",
				"date": "August 20, 2023"
			},
			{
				"rating": 5,
				"title": "Fast and reliable",
				"body": "Good stuff",
				"name": "Ernsley Victome",
				"date": "August 19, 2023"
			},
			{
				"rating": 5,
				"title": "Cool",
				"body": "Does what it claim",
				"name": "Chris Allen",
				"date": "August 19, 2023"
			},
			{
				"rating": 5,
				"title": "AWESOME",
				"body": "WORKED WELL",
				"name": "Sebastian Perez",
				"date": "August 15, 2023"
			},
			{
				"rating": 5,
				"title": "It worked",
				"body": "It worked. Spent $50, got $50.",
				"name": "Meghan",
				"date": "August 13, 2023"
			},
			{
				"rating": 4,
				"title": "it worked",
				"body": "kind of annoying to use but I got an Amazon gift card and converted it to this and I didn't have to pay for an extra hunk of plastic",
				"name": "Caz",
				"date": "July 29, 2023"
			},
			{
				"rating": 5,
				"title": "Extremely easy to use.",
				"body": "Just buy the card and an email gets sent to your email inbox with the code attached. Simply put the code into your Nintendo account and you’ve got your credits to buy a smaller game or some DLC. Would recommend for gifts and smaller purchases.",
				"name": "Adam Tompkins",
				"date": "July 22, 2023"
			},
			{
				"rating": 5,
				"title": "Bien",
				"body": "Bien",
				"name": "Alam Gomez",
				"date": "August 16, 2023"
			},
			{
				"rating": 5,
				"title": "Loved it",
				"body": "Super easy to use",
				"name": "Min",
				"date": "August 12, 2023"
			},
			{
				"rating": 5,
				"title": "Good eshop card",
				"body": "I got mk11",
				"name": "charlie",
				"date": "August 11, 2023"
			},
			{
				"rating": 5,
				"title": "Fast and easy",
				"body": "You get a code instantly, enter the code on the Nintendo eShop and that’s it.",
				"name": "Felipe",
				"date": "July 31, 2023"
			},
			{
				"rating": 5,
				"title": "el envio del codigo es inmediato",
				"body": "excelente, compraria de nuevo",
				"name": "Jorge",
				"date": "August 8, 2023"
			},
			{
				"rating": 5,
				"title": "love gift cards",
				"body": "I love the 20 gift cards to buy the yearly sub to Nintendo! If you forget about it you wont get a surprise bill in your bank account and it's simple to use.",
				"name": "Megan Roller",
				"date": "July 20, 2023"
			},
			{
				"rating": 5,
				"title": "10/10",
				"body": "code works",
				"name": "Mayleen",
				"date": "August 9, 2023"
			},
			{
				"rating": 5,
				"title": "Funciona",
				"body": "Enseguida llegó por correo electrónico, a mi hijo le encanta",
				"name": "Ana S.",
				"date": "July 30, 2023"
			},
			{
				"rating": 5,
				"title": "Exactly what you’re buying",
				"body": "What more can I say?",
				"name": "OGCrunch87",
				"date": "August 5, 2023"
			},
			{
				"rating": 5,
				"title": "Reliable and Fast",
				"body": "I have requested this product and the process has been reliable and very fast, in addition to the fact that the redemption process is quite easy!!!",
				"name": "Javier Gomez",
				"date": "July 18, 2023"
			},
			{
				"rating": 5,
				"title": "Ez",
				"body": "Was easy to use",
				"name": "Carson",
				"date": "August 4, 2023"
			},
			{
				"rating": 5,
				"title": "Great",
				"body": "Kids love gift cards",
				"name": "Amazon Customer",
				"date": "August 3, 2023"
			},
			{
				"rating": 5,
				"title": "This changed my life",
				"body": "I used to feel a lack of purpose on this desolate planet, yet now I feel special, adored, and loved because of this product. Thank you, Nintendo. Thank you.",
				"name": "Hugh M.",
				"date": "July 17, 2023"
			}
		]
	},
	"B00GAC1D2G": {
		"reviews": [
			{
				"rating": 5,
				"title": "It's a PlayStation card lol",
				"body": "There isn't much to say. But I purchase these for my kiddo all the time. I do like that I don't have to leave the house to get him a card. I don't like using my cards on his system so this is a huge convenience because we buy a lot of these. And Amazon is super quick with sending the codes. By the time I complete the purchase and get back to the \"My Orders\" screen, the card is already there. This allows me to purchase from home, not give my card info to any of the game systems, and it reduces waste because you don't have to throw away a physical card. Convenience is a big deal so that's why I give this 5 stars. It's just a gift card otherwise but it's quick and easy",
				"name": "Kelley Rogers",
				"date": "August 19, 2023"
			},
			{
				"rating": 5,
				"title": "Great instant reward for a child",
				"body": "Purchasing this gift card via Amazon seems much simpler than logging on to the PS app or the actual gaming console, going through security measures, and adding funds. Most retail stores dont offer $10 cards so its great that you can get one for as low as $10. A $5 option would also be great since children can make $1.99 purchases for Vbucks and so forth.",
				"name": "330girl",
				"date": "August 22, 2023"
			},
			{
				"rating": 5,
				"title": "Easy ordering and redeeming ps4 gift card",
				"body": "This order option is Wonderful!  It’s easy to purchase and redeem!  No waiting on mail delivery; and no trips to the local store to purchase your PlayStation gift cards!; which gives you an immediate access code!  I use this method to order all of the time now! -And the children loves it!  What a great way to gift(?)!! This is Amazing!",
				"name": "Cee Warrick",
				"date": "August 14, 2023"
			},
			{
				"rating": 5,
				"title": "Worked fine",
				"body": "Great gift idea when you don’t want to duplicate something grandbabies already have and they can use with their games.",
				"name": "Cindilou",
				"date": "August 24, 2023"
			},
			{
				"rating": 5,
				"title": "Keep up like this Sony,and I’ll be back.",
				"body": "I was kinda worried when I purchased this card/code after reading some of the reviews about Amazon and Sony leaving put up the creek over bad numbers.i took the chance and purchased this one along with a $30.00 card/code so I could pre-order MK 1 premium (a/k/a “MK 12 premium”). They both worked! I had no problems whatsoever, the codes added the appropriate amounts to my wallet.",
				"name": "G",
				"date": "August 7, 2023"
			},
			{
				"rating": 5,
				"title": "Cumplió con su cometido.",
				"body": "He comprado tantas y sony nunca me ha dado una almenos de regalo 🥺",
				"name": "alex polanco",
				"date": "August 26, 2023"
			},
			{
				"rating": 5,
				"title": "Fast and easy",
				"body": "Fast and easy purchase.  Bought for a child who was able to redeem it almost immediately.  Purchase was great.",
				"name": "Jillian Frost",
				"date": "August 20, 2023"
			},
			{
				"rating": 4,
				"title": "Long wait",
				"body": "took about ten minutes to send to my email and got a lil nervous but I got it and it works nonetheless",
				"name": "Jay",
				"date": "August 22, 2023"
			},
			{
				"rating": 5,
				"title": "Great Gift Card",
				"body": "You can't go wrong with a PS digital gift card.",
				"name": "Steve Kinney",
				"date": "August 27, 2023"
			},
			{
				"rating": 5,
				"title": "Gift cards",
				"body": "It's a gift card what more can I say",
				"name": "Chris Blankenship",
				"date": "August 25, 2023"
			},
			{
				"rating": 5,
				"title": "Little brother",
				"body": "We buy these for the little brother to gift him for good behavior! Haha. Works great rather than having to go to the store to buy and send one.",
				"name": "Kaylie",
				"date": "August 15, 2023"
			},
			{
				"rating": 4,
				"title": "Works great 😊",
				"body": "This card allows us to safely purchase what we need without hai to use a credit or debit card.",
				"name": "Where’s the REVERSE? This bike only goes forward, and the instructions to assemble are not good. I was able to figure it out, but many people might not be able to. Who do I call to ask about the bike and if it should have reverse?",
				"date": "August 19, 2023"
			},
			{
				"rating": 5,
				"title": "Fast and easy",
				"body": "Immediately got my code in my email. Very fast and easy way to add funds to your psn account",
				"name": "Adam Ortega",
				"date": "August 16, 2023"
			},
			{
				"rating": 5,
				"title": "Super rápido",
				"body": "Lo bueno de este servicio es la disposición inmediata del código de la tarjeta. Me gustó.!!",
				"name": "ELIAS OCQUE",
				"date": "August 17, 2023"
			},
			{
				"rating": 5,
				"title": "Great easy gift",
				"body": "I get them for my boyfriend from time to time and they work perfectly",
				"name": "Kerri",
				"date": "August 19, 2023"
			},
			{
				"rating": 5,
				"title": "Fast and easy",
				"body": "Pretty easy to redeem, just buy it and follow the steps to get the code, then enter it in the ps store to redeem it…",
				"name": "Justin",
				"date": "August 15, 2023"
			},
			{
				"rating": 5,
				"title": "Digital Online Code",
				"body": "It’s a fast way to buy a e code online, once bought they send you the code via gmail. Amazing, fast, and efficient.",
				"name": "Michael Guerrero",
				"date": "August 15, 2023"
			},
			{
				"rating": 5,
				"title": "Nice to give as gift",
				"body": "Great gift idea",
				"name": "Debbi Bullock",
				"date": "August 25, 2023"
			},
			{
				"rating": 5,
				"title": "Cool beans",
				"body": "Easy then gone to store",
				"name": "Jeffy",
				"date": "August 24, 2023"
			},
			{
				"rating": 5,
				"title": "Gift card",
				"body": "Great value",
				"name": "Renay",
				"date": "August 26, 2023"
			},
			{
				"rating": 5,
				"title": "Assume",
				"body": "Need it for gaming",
				"name": "mark",
				"date": "August 24, 2023"
			},
			{
				"rating": 5,
				"title": "Love",
				"body": "Got the code in no time😊",
				"name": "Love",
				"date": "August 20, 2023"
			},
			{
				"rating": 5,
				"title": "Facil de procesar",
				"body": "Es sencillo de añadir el balance al wallet. Funciona super.",
				"name": "Thanya Alvarado",
				"date": "August 19, 2023"
			},
			{
				"rating": 5,
				"title": "Justo para 30 dias",
				"body": "Excelente para solo pagar un mes de suscripción",
				"name": "Arnoldo Sanchez",
				"date": "August 18, 2023"
			},
			{
				"rating": 5,
				"title": "Convenient",
				"body": "Love purchasing this online so easy",
				"name": "Amanda Nicole Richard",
				"date": "August 22, 2023"
			},
			{
				"rating": 5,
				"title": "Good",
				"body": "So easy to use it digitally.",
				"name": "Shez",
				"date": "August 19, 2023"
			},
			{
				"rating": 5,
				"title": "Easier than going to the store",
				"body": "So easy! My child loves to trade in chore money for PlayStation gift cards. I for some reason thought I had to go to the store up the street and buy actual cards. Then I found out that I can buy them on Amazon and I get a digital code in my email that my child can use. I love not having to run to the store. So easy, takes 2 minutes. I can’t buy time, but I can save some buying PlayStation money on here.",
				"name": "Alyssa Mazz",
				"date": "July 17, 2023"
			},
			{
				"rating": 5,
				"title": "Amazing",
				"body": "Got 3 Months of ps plus",
				"name": "Junior!",
				"date": "August 16, 2023"
			},
			{
				"rating": 5,
				"title": "You know what you get",
				"body": "It just a card online",
				"name": "Cesar Ruiz Martniz",
				"date": "August 21, 2023"
			},
			{
				"rating": 5,
				"title": "Works  like a champ",
				"body": "Need a last-minute gift or last minute PlayStation points. This is a great way to not have to go to the store and be able to use it instantly with a digital code.",
				"name": "Cbbb",
				"date": "August 4, 2023"
			},
			{
				"rating": 5,
				"title": "It is what it is",
				"body": "I order the $10 and I receive the $10 all for the low price of $10. Awesome!",
				"name": "Bugman",
				"date": "August 10, 2023"
			},
			{
				"rating": 5,
				"title": "Fr",
				"body": "Great",
				"name": "Zach Bryce",
				"date": "August 25, 2023"
			},
			{
				"rating": 5,
				"title": "Good product",
				"body": "Super fast transaction.  Thank you!",
				"name": "Jorge Scaff",
				"date": "August 20, 2023"
			},
			{
				"rating": 5,
				"title": "Rápido y seguro",
				"body": "Excelente opción para comprar ya que te llega al correo al instante y todo muy seguro.",
				"name": "Mynor",
				"date": "August 12, 2023"
			},
			{
				"rating": 5,
				"title": "Entrega inmediata",
				"body": "Excelente",
				"name": "Mike",
				"date": "August 16, 2023"
			},
			{
				"rating": 5,
				"title": "🥲😁",
				"body": "Cool but I’m sad I spent $70",
				"name": "Aniya",
				"date": "August 7, 2023"
			},
			{
				"rating": 5,
				"title": "Easy to use !",
				"body": "Just follow the instructions",
				"name": "David Robinson",
				"date": "August 19, 2023"
			},
			{
				"rating": 5,
				"title": "works like always",
				"body": "I've been buying this gift card since 2017, it works like a charm every time.",
				"name": "Sanaa Albaha",
				"date": "August 4, 2023"
			},
			{
				"rating": 5,
				"title": "It’s a digital code emailed to me",
				"body": "I mean, it gave me the money on my PlayStation account and the code was emailed to me quickly. Like in 5-10 min time.",
				"name": "Michael Gridley",
				"date": "July 28, 2023"
			},
			{
				"rating": 5,
				"title": "fire",
				"body": "fire",
				"name": "II-5STARR-LOS-II",
				"date": "August 21, 2023"
			}
		]
	},
	"B0153X7HKY": {
		"reviews": [
			{
				"rating": 5,
				"title": "PERFECT",
				"body": "i also bought a $50 card; again, you're getting EXACTLY the price specified worth of riot points. no more $5 extra for taxes & bs",
				"name": "Luna LeViege",
				"date": "August 18, 2023"
			},
			{
				"rating": 5,
				"title": "Feeding my addiction",
				"body": "Its a gift card for a video game called league of legends. I am thoroughly addicted so this was perfect for me and my needs in the game. I got this during prime day a few weeks back at a great discount so I love it even more.",
				"name": "Brienna Avila",
				"date": "July 26, 2023"
			},
			{
				"rating": 5,
				"title": "Works",
				"body": "works",
				"name": "Qasim H.",
				"date": "August 14, 2023"
			},
			{
				"rating": 5,
				"title": "Works fast",
				"body": "Was able to get myself soul fighter Gwen :)",
				"name": "Thundaurda",
				"date": "August 4, 2023"
			},
			{
				"rating": 5,
				"title": "Riot points",
				"body": "Received instantly, cheaper then if you would purchase on client",
				"name": "Elijah",
				"date": "July 30, 2023"
			},
			{
				"rating": 5,
				"title": "yay more yuumi skins!",
				"body": "more money for yuumi skins woot",
				"name": "Kat",
				"date": "August 1, 2023"
			},
			{
				"rating": 5,
				"title": "Gift card",
				"body": "Great value!",
				"name": "Cindy",
				"date": "August 5, 2023"
			},
			{
				"rating": 5,
				"title": "Comes quickly",
				"body": "A bit enjoying to type in the code if you get it on mobile, but the code does come quickly.",
				"name": "Current Resident",
				"date": "July 17, 2023"
			},
			{
				"rating": 5,
				"title": "Pretty good",
				"body": "Received code instantly no issues at all",
				"name": "Jordan Beng",
				"date": "July 26, 2023"
			},
			{
				"rating": 5,
				"title": "amazing i love league",
				"body": "my mom blocked my card after she found out but im up anyways",
				"name": "Erisa",
				"date": "July 24, 2023"
			},
			{
				"rating": 5,
				"title": "Good",
				"body": "I got my code  fast.",
				"name": "June",
				"date": "July 24, 2023"
			},
			{
				"rating": 5,
				"title": "Easy to use",
				"body": "Just enter the code into the ingame store to redeem your gift card.",
				"name": "Frank Martinez",
				"date": "July 16, 2023"
			},
			{
				"rating": 4,
				"title": "Came in fast but the price needs to be updated!",
				"body": "With the new league patch this gives you roughly 1200 RP which is not enough for a basic Epic skin. I think it'd be better if they updated this to $11 which is the price of one epic skin.Id recommend you just purchase from league directly if you're looking for an epic skinLmk if this review was helpful!",
				"name": "Taylor",
				"date": "April 28, 2023"
			},
			{
				"rating": 5,
				"title": "works",
				"body": "it worked with very little hassle",
				"name": "Wyatt Diggs",
				"date": "July 1, 2023"
			},
			{
				"rating": 5,
				"title": "Quick, reliable.",
				"body": "Also, because the product doesn't actually STATE the RP amounts anywhere -- $10 is 1240 RP. Not sure on other denominations.",
				"name": "Nothing but Novels",
				"date": "June 23, 2023"
			},
			{
				"rating": 5,
				"title": "Does the trick",
				"body": "It works, wow!",
				"name": "MaddMan",
				"date": "June 25, 2023"
			},
			{
				"rating": 5,
				"title": "Easy and fast",
				"body": "Easy and fast",
				"name": "Cristhofer",
				"date": "June 16, 2023"
			},
			{
				"rating": 5,
				"title": "Instant Results",
				"body": "You can pull the code instantly from the \"game codes\" section in this site. I got my RP within 5 mins of buying this card and it saved me a trip to the store in the morning.",
				"name": "Samantha Ryder",
				"date": "May 2, 2023"
			},
			{
				"rating": 5,
				"title": "10/10 boyfriend says",
				"body": "my fat boyfriend loves league of legends so much that he can never leave his room from playing it!! i wash him and bring a bucket for him to go to the bathroom in bc he cant leave his room, he loves it that much 🩷 i am sure this will make him beyond happy",
				"name": "ari",
				"date": "April 16, 2023"
			},
			{
				"rating": 5,
				"title": "Finally able to buy RP",
				"body": "Received a Visa Vanilla Gift Card but kept getting an invalid error message when trying to use it in the League client. Someone on Reddit said to add it as a payment method on PayPal then select PayPal in the League client..... that didn't work either; PayPal rejected the card. Saw this digital code option on Amazon and yay! It worked! It was a 1:1 transaction too, so no tax or extra little payments, so was able to use the full amount from my Visa. :)",
				"name": "Sierra Stalians",
				"date": "February 18, 2023"
			},
			{
				"rating": 3,
				"title": "Less RP than expected",
				"body": "Got the $25 card, was expecting ~3500RP based on info online. It only gave 3200.Riot should include accurate info in the item description, depicting how much RP comes with each card.",
				"name": "Tony",
				"date": "June 1, 2023"
			},
			{
				"rating": 5,
				"title": "Never disappointed",
				"body": "My league addiction leaves me never disappointed when I buy more RP",
				"name": "Marissa",
				"date": "May 16, 2023"
			},
			{
				"rating": 5,
				"title": "It works",
				"body": "It works like any gift card",
				"name": "Don't worry about it",
				"date": "May 21, 2023"
			},
			{
				"rating": 5,
				"title": "Worked",
				"body": "It took a while to actually receive the code but it worked as it should. I used a $25 visa I had gotten for my birthday to pay for the e-giftcard code so happy I was able to use the whole value of the card.",
				"name": "Dina G",
				"date": "March 23, 2023"
			},
			{
				"rating": 5,
				"title": "Always great",
				"body": "💯",
				"name": "Amazon Customer",
				"date": "May 25, 2023"
			},
			{
				"rating": 5,
				"title": "Nice quick gift",
				"body": "A favorite small gift to give to those who enjoy playing League",
				"name": "Salem Jayde",
				"date": "April 25, 2023"
			},
			{
				"rating": 5,
				"title": "I mean, it's still just 10 bucks.",
				"body": "Saves you a trip of having to get out of the house.",
				"name": "David Xiong",
				"date": "April 23, 2023"
			},
			{
				"rating": 4,
				"title": "Misleading",
				"body": "Bought $25 card. Been buying from this source for years. Never failed me. Well, bought the card. Went to Digital Orders, nothing pops up. Says there is no order in there, there's no code provided, nothing.Update: Previously set at 1 star, updated to 3.So apparently it now gets sent to your email instead of digital orders. Still weird, not sure why the change. But it does work.",
				"name": "Jamie Wry",
				"date": "September 20, 2022"
			},
			{
				"rating": 5,
				"title": "Works as expected",
				"body": "Works as expected! Instantly got an email from Amazon with my code, redeemed it with no issues.The $25 USD card redeemed for 3190 RP in NA. Almost exactly the same ratio of USD to RP as the $22 card at 0.33 more RP per $1 USD.",
				"name": "Alex Belle",
				"date": "February 8, 2023"
			},
			{
				"rating": 4,
				"title": "Love it got me RP slightly less than before now which sucks but its ok!",
				"body": "I love buying these I buy them VERY frequently! However, the amount of RP given recently dropped slightly which was kind of sad since I missed out on buying a skin I wanted but its ok! I still got great bang for my buck. :D",
				"name": "Bailey",
				"date": "October 30, 2022"
			},
			{
				"rating": 5,
				"title": "leavye",
				"body": "legends",
				"name": "kori",
				"date": "May 6, 2023"
			},
			{
				"rating": 5,
				"title": "valorant battle pass",
				"body": "i am not just your healer",
				"name": "water bottle",
				"date": "April 15, 2023"
			},
			{
				"rating": 3,
				"title": "Works.? Really slow and maybe glitched.",
				"body": "Works, just enter it normally.Only issue is how long it takes. Takes a few minutes to show up under order, the code shows up slower. Maybe even glitched? Ordered another code, $50, after and it hasn’t even showed up under orders still. (2x and not showing up)",
				"name": "Daria",
				"date": "March 19, 2023"
			},
			{
				"rating": 5,
				"title": "I don’t know why I keep coming back either",
				"body": "League is an addiction",
				"name": "Maya",
				"date": "April 9, 2023"
			},
			{
				"rating": 5,
				"title": "Good",
				"body": "Good",
				"name": "angel",
				"date": "April 15, 2023"
			},
			{
				"rating": 5,
				"title": "Works",
				"body": "My apartment gave me free amazon gift cards for taking surveys. Therefore, riot can have free money that I earned while wasting my time.",
				"name": "Morghan",
				"date": "February 20, 2023"
			},
			{
				"rating": 5,
				"title": "Works",
				"body": "Good",
				"name": "Noah M.",
				"date": "April 10, 2023"
			},
			{
				"rating": 5,
				"title": "Simple",
				"body": "Very short and sweet and easy I was a little confused on where to see the code but it worked out great",
				"name": "._.",
				"date": "February 9, 2023"
			},
			{
				"rating": 5,
				"title": "pog",
				"body": "league",
				"name": "C F",
				"date": "March 26, 2023"
			},
			{
				"rating": 4,
				"title": "Got delivered and works but it took a while.",
				"body": "Not much to review here since it's just a Gift Card but I'll judge it based on speed and functionality.I wanted to pick this up for my brother's birthday. Bought it at around 4:25 PM, I received the code in my email and digital items library at 5:21 PM. Not the worst but I would hardly call an almost 1-hour wait and \"instant\" delivery. The code works fine but it just took far longer than I expected. Probably would have been faster to just walk to my nearest 7-11 and pick up points that way but with COVID being an issue I wanted to avoid going out.P.S. I don't play League of Legends myself, otherwise I probably would have gifted it to him instead.",
				"name": "Alex",
				"date": "May 21, 2021"
			}
		]
	}
}